InformationRegisters/ХарактеристикиОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПрофессиональнойПодготовки</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофессиональныеСтандарты</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтраслиНауки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцедурАккредитацииСпециалистов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭлементыКлассификаторовФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭлементыКлассификаторовФедеральныхМедрегистров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлассификаторыФедеральныхМедрегистров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписаниеЭлемента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВвода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключенаИзШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВведенаВШтатноеРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностьюЛетногоЭкипажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШахтерскойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяФармацевтическойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияВоинскогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияУчетаЗабронированных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляУчетаЗабронированных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛетноПодъемныйСостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плавсостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрокаОтчетностиМониторингаРаботниковСоциальнойСферы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСеткаНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегорияНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКЧ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКЗКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКоронавирусом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаЛетныхЭкипажей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаЛетныхЭкипажей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаШахтеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаШахтеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностьюЕдиноличногоРуководителяКоммерческойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специальности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеСтажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтажа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ХарактеристикиОбъектовДляФедеральныхМедрегистров/Forms/КлассификацияОбъектовДляФедеральныхМедрегистров/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеСпискаИменОбъектов();
		
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Тип Из ИменаОбъектов Цикл
		Элементы.ТекущийОбъектМетаданных.СписокВыбора.Добавить(Тип.ПолноеИмя, Тип.ПолныйСиноним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат, ДополнительныеПараметры) Экспорт 
	
	ПредыдущийОбъектМетаданных = ТекущийОбъектМетаданных;

	СохранениеИзмененийНаСервере();
		
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущийОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПредыдущийОбъектМетаданных = ТекущийОбъектМетаданных;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийОбъектМетаданныхПриИзменении(Элемент)
		
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");

		Оповещение = Новый ОписаниеОповещения("ТекущийОбъектМетаданныхПриИзмененииЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет);
		
	Иначе	
		ТекущийОбъектМетаданныхПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеризуемыеОбъекты

&НаКлиенте
Процедура ХарактеризуемыеОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ХарактеризуемыеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Поле.Имя = "ХарактеризуемыеОбъектыОбъект" Тогда
		
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			СтандартнаяОбработка = Не Элемент.ТекущиеДанные.ЭтоГруппа;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеризуемыеОбъектыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
			Отказ = Истина;
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Объект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Если Модифицированность Тогда
		
		ПредыдущийОбъектМетаданных = ТекущийОбъектМетаданных;
		
		СохранениеИзмененийНаСервере();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	
	ПредыдущийОбъектМетаданных = ТекущийОбъектМетаданных;

	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("СопоставитьЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе	
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
			МодульИнтернетПоддержкаПользователейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент"); 
			АвтосопоставлениеПриНаличииПодключения = Новый ОписаниеОповещения("СопоставитьЗначенияИОбновитьТаблицу", ЭтотОбъект, Ложь);
			МодульИнтернетПоддержкаПользователейКлиент.НачатьПроверкуИПодключениеИнтернетПоддержкиПользователей(АвтосопоставлениеПриНаличииПодключения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииДляФормы

&НаСервере
Процедура ЗаполнениеСпискаИменОбъектов()
	
	ОписаниеХарактеристик = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.ХарактеристикиОбъектовМетаданныхДляМедРегистра();
	ТипыОбъектов = ОписаниеХарактеристик.Скопировать(, "ТипОбъектаМетаданных");
	ТипыОбъектов.Свернуть("ТипОбъектаМетаданных");
	
	Для Каждого Тип Из ТипыОбъектов Цикл
		
		ЗаполнитьЗначенияСвойств(
			ИменаОбъектов.Добавить(), 
			РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СвойстваОбъектаМетаданных(Тип.ТипОбъектаМетаданных));
		
	КонецЦикла;
	
	ИменаОбъектов.Сортировать("ПолноеИмя");

КонецПроцедуры // ЗаполнениеСпискаИменОбъектов()

&НаСервере
Процедура ЗаполнитьТаблицуХарактеризуемыхОбъектов()

	ХарактеризуемыеОбъекты.ПолучитьЭлементы().Очистить();
	
	Если Не ЗначениеЗаполнено(ТекущийОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеВозможно = Ложь;
	
	// Описание добавляемых элементов.
	ОписаниеОбъекта      = ИменаОбъектов.НайтиСтроки(Новый Структура("ПолноеИмя", ТекущийОбъектМетаданных))[0];
	СтрокаТипОбъекта	 = ОписаниеОбъекта.ТипОбъекта;
	СинонимОбъекта       = ОписаниеОбъекта.ПредставлениеОбъекта;
	ТаблицаХарактеристик = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.ХарактеристикиОбъектаМетаданныхДляРегистра(Тип(СтрокаТипОбъекта));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ХарактеризуемыеОбъектыОбъект",
		"Заголовок",
		СинонимОбъекта);
	
	// Подготовим массив удаляемых Реквизитов формы.
	// Заодно и удалим все программно созданные поля формы.
	МассивУдаляемыхРеквизитов = Новый Массив;
	ХарактеризуемыеОбъектыЗначение = РеквизитФормыВЗначение("ХарактеризуемыеОбъекты", Тип("ДеревоЗначений"));
	Для Каждого Колонка Из ХарактеризуемыеОбъектыЗначение.Колонки Цикл
	
		Если Колонка.Имя = "Объект" 
			Или Колонка.Имя = "ЭтоГруппа"
			Или Колонка.Имя = "СтандартнаяКартинка"
			Или Колонка.Имя = "Владелец" Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивУдаляемыхРеквизитов.Добавить("ХарактеризуемыеОбъекты." + Колонка.Имя);
		
		// Удалим поле формы
		ЭлементФормыКолонка = Элементы.Найти("ХарактеризуемыеОбъекты" + Колонка.Имя);
		Если ЭлементФормыКолонка <> Неопределено Тогда
			Элементы.Удалить(ЭлементФормыКолонка);
		КонецЕсли;
		
	КонецЦикла; 
	
	// Соберем таблицу Характеристик объектов 
	// + подготовим массив добавляемых реквизитов формы.
	
	МассивДобавляемыхРеквизитов = Новый Массив;	
	
	ТекстЗапроса = "ВЫБРАТЬ
		| СписокОбъектов.Ссылка КАК Объект";
	Если ОписаниеОбъекта.ЕстьВладелец Тогда
	    ТекстЗапроса = ТекстЗапроса +",
		    | СписокОбъектов.Владелец КАК Владелец";
	КонецЕсли;
		
	Если ОписаниеОбъекта.ИерархияГрупп Тогда // Иерархический справочник с иерархией групп.
		ТекстЗапроса = ТекстЗапроса +",
		    |   СписокОбъектов.ЭтоГруппа КАК ЭтоГруппа,
            |	ВЫБОР
            |		КОГДА СписокОбъектов.ЭтоГруппа
            |				И СписокОбъектов.ПометкаУдаления
            |			ТОГДА 1
            |		КОГДА СписокОбъектов.ЭтоГруппа
            |				И СписокОбъектов.Предопределенный
            |			ТОГДА 2
            |		КОГДА СписокОбъектов.ЭтоГруппа
            |			ТОГДА 0
            |		КОГДА СписокОбъектов.ПометкаУдаления
            |			ТОГДА 4
            |		КОГДА СписокОбъектов.Предопределенный
            |			ТОГДА 5
            |		ИНАЧЕ 3
            |	КОНЕЦ КАК СтандартнаяКартинка";
	ИначеЕсли ОписаниеОбъекта.ЭтоСправочник Тогда // Справочник или ПВР (могут быть помеченные на удаление элементы).
		ТекстЗапроса = ТекстЗапроса +",
		    |   ЛОЖЬ КАК ЭтоГруппа,
            |	ВЫБОР
            |		КОГДА СписокОбъектов.ПометкаУдаления
            |			ТОГДА 4
            |		КОГДА СписокОбъектов.Предопределенный
            |			ТОГДА 5
            |		ИНАЧЕ 3
            |	КОНЕЦ КАК СтандартнаяКартинка";
	Иначе										// перечисление
        ТекстЗапроса = ТекстЗапроса +",
		    |   ЛОЖЬ КАК ЭтоГруппа,
            |	3 КАК СтандартнаяКартинка";
	КонецЕсли;				
			
	ТекстЗапросаИЗ = "
    |ИЗ
    |	" + ТекущийОбъектМетаданных + " КАК СписокОбъектов";		
	
	Для Каждого Характеристика Из ТаблицаХарактеристик Цикл
					
		ТекстЗапроса = ТекстЗапроса + ",
			| ЕСТЬNULL(КлассификацияОбъектовДляМедРегистра_" + Характеристика.ИДСправочника + ".Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) КАК " + Характеристика.ИДСправочника;
			
	    ТекстЗапросаИЗ = ТекстЗапросаИЗ + "
            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК КлассификацияОбъектовДляМедРегистра_" + Характеристика.ИДСправочника + "
            |		ПО СписокОбъектов.Ссылка = КлассификацияОбъектовДляМедРегистра_" + Характеристика.ИДСправочника + ".Объект
			|        И КлассификацияОбъектовДляМедРегистра_" + Характеристика.ИДСправочника + ".Классификатор.код = """ + Характеристика.КодКлассификатора + """ ";
			
			
		НовыйРеквизит = Новый РеквизитФормы(Характеристика.ИДСправочника, Новый ОписаниеТипов("СправочникСсылка.ЭлементыКлассификаторовФедеральныхМедрегистров"), "ХарактеризуемыеОбъекты");
	    МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		СопоставлениеВозможно = Макс(СопоставлениеВозможно, Характеристика.ЭлементыСопоставимы);
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаИЗ;
	
	Если ОписаниеОбъекта.Иерархический Тогда 
		
		ТекстЗапроса = ТекстЗапроса + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Объект ИЕРАРХИЯ";
					
	ИначеЕсли ОписаниеОбъекта.ЕстьВладелец Тогда
					
		ТекстЗапроса = ТекстЗапроса + "
			|
			|ИТОГИ ПО
			|	Владелец";
					
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ДанныеСправочника = Запрос.Выполнить().Выгрузить(?(ОписаниеОбъекта.Иерархический Или ОписаниеОбъекта.ЕстьВладелец, ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, ОбходРезультатаЗапроса.Прямой));

	// Изменяем состав реквизитов формы.
	Если (МассивДобавляемыхРеквизитов.Количество() + МассивУдаляемыхРеквизитов.Количество())>0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	КонецЕсли;
	
	// Заполняем дерево ХарактеризуемыеОбъекты.
	Если ОписаниеОбъекта.ЕстьВладелец Тогда
		Если ОписаниеОбъекта.ПолноеИмя = "Справочник.ПодразделенияОрганизаций" Тогда
			ВыборкаОрганизаций = Справочники.Организации.Выбрать();
			КоллекцияЭлементовДерева = ХарактеризуемыеОбъекты.ПолучитьЭлементы();
			Пока ВыборкаОрганизаций.Следующий() Цикл
				ДанныеПоОрганизации = ДанныеСправочника.Строки.НайтиСтроки(Новый Структура("Владелец", ВыборкаОрганизаций.Ссылка));
				Если ДанныеПоОрганизации.Количество() Тогда
					ЭлементВладелец = КоллекцияЭлементовДерева.Добавить();
					ЭлементВладелец.Объект = ВыборкаОрганизаций.Ссылка;
					ЭлементВладелец.ЭтоГруппа = Истина;
					ЭлементВладелец.СтандартнаяКартинка = 6;
					
					КоллекцияВладельца = ЭлементВладелец.ПолучитьЭлементы(); 
					Для Каждого СтрокиПоОрганизации Из ДанныеПоОрганизации Цикл
						ЭлементДерева = КоллекцияВладельца.Добавить();
						ЗаполнитьЗначенияСвойств(ЭлементДерева, СтрокиПоОрганизации);
						Если СтрокиПоОрганизации.Строки.Количество() Тогда
							ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементДерева.ПолучитьЭлементы(), СтрокиПоОрганизации);
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;
		Иначе
			КоллекцияЭлементовДерева = ХарактеризуемыеОбъекты.ПолучитьЭлементы();
			Владельцы = ДанныеСправочника.Строки;
			Для Каждого Владелец Из Владельцы Цикл
				ЭлементВладелец = КоллекцияЭлементовДерева.Добавить();
				ЭлементВладелец.Объект = Владелец.Владелец;
				ЭлементВладелец.ЭтоГруппа = Истина;
				ЭлементВладелец.СтандартнаяКартинка = 6;
			    ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементВладелец.ПолучитьЭлементы(), Владелец);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ОписаниеОбъекта.Иерархический Тогда
		ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ХарактеризуемыеОбъекты.ПолучитьЭлементы(), ДанныеСправочника);
	Иначе
		ЭлементыДереваХарактеризуемыхОбъектов = ХарактеризуемыеОбъекты.ПолучитьЭлементы();
		Для Каждого Строка Из ДанныеСправочника Цикл
			ЭлементДерева = ЭлементыДереваХарактеризуемыхОбъектов.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементДерева, Строка);
		КонецЦикла;
	КонецЕсли;

	// Создаем элементы формы.
	Для Каждого Реквизит Из МассивДобавляемыхРеквизитов Цикл
		
		НовыйЭлемент = Элементы.Добавить(
						"ХарактеризуемыеОбъекты" + Реквизит.Имя, 
						Тип("ПолеФормы"), 
						Элементы.ХарактеризуемыеОбъекты);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ХарактеризуемыеОбъекты." + Реквизит.Имя;
		
		Если Реквизит.Имя = "Владелец" Тогда 
			Продолжить;
		КонецЕсли;
		ХарактеристикаРеквизита = ТаблицаХарактеристик.Найти(Реквизит.Имя, "ИДСправочника");
		НовыйЭлемент.Заголовок = ХарактеристикаРеквизита.ПредставлениеХарактеристики; 
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ХарактеристикаРеквизита.Классификатор));
		НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
		Если ХарактеристикаРеквизита.ТипОбъектаМетаданных = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			СвязиПараметровВыбора = Новый Массив;
			СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Элементы.ХарактеризуемыеОбъекты.ТекущиеДанные.Владелец"));
			НовыйЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
		КонецЕсли;
		
		НовыйЭлемент.ФормаВыбора = "Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.Форма.ФормаСписка.";
		
		// Установим действие.
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ХарактеристикаПриИзменении");
		
	КонецЦикла;
	
	Настройки = МедицинскиеРегистры.ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	ИспользоватьАвтосопоставление1СЕГИСЗ = Настройки.ИспользоватьАвтосопоставление1СЕГИСЗ;
	Элементы.ФормаСопоставить.Доступность = СопоставлениеВозможно 
			И ИспользоватьАвтосопоставление1СЕГИСЗ 
			И ТекущийОбъектМетаданных = "Справочник.Должности" 
			И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей");

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ХарактеристикаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииСохранения

&НаСервере
Процедура СохранениеИзмененийНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект КАК Объект,
	               |	ХарактеристикиОбъектовДляФедеральныхМедрегистров.Классификатор КАК Классификатор,
	               |	ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика КАК Характеристика
	               |ИЗ
	               |	РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектовДляФедеральныхМедрегистров";
	
	КлассификацияОбъектов = Запрос.Выполнить().Выгрузить();
	
	ОписаниеОбъекта      = ИменаОбъектов.НайтиСтроки(Новый Структура("ПолноеИмя", ?(ПустаяСтрока(ПредыдущийОбъектМетаданных), ТекущийОбъектМетаданных, ПредыдущийОбъектМетаданных)))[0];
	ТаблицаХарактеристик = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.ХарактеристикиОбъектаМетаданныхДляРегистра(Тип(ОписаниеОбъекта.ТипОбъекта));
	
	ДеревоХарактеризуемыеОбъекты = РеквизитФормыВЗначение("ХарактеризуемыеОбъекты", Тип("ДеревоЗначений"));
    КонвертацияХарактеризуемыеОбъектыВТаблицу(ДеревоХарактеризуемыеОбъекты, КлассификацияОбъектов, ТаблицаХарактеристик);
	
	Если КлассификацияОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДанныеФормы", КлассификацияОбъектов);
	Запрос.Текст = "ВЫБРАТЬ
       |	ДанныеФормы.Объект КАК Объект,
       |	ДанныеФормы.Классификатор КАК Классификатор,
       |	ДанныеФормы.Характеристика КАК Характеристика
       |ПОМЕСТИТЬ ВТДанныеФормы
       |ИЗ
       |	&ДанныеФормы КАК ДанныеФормы
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ РАЗЛИЧНЫЕ
       |	ВТДанныеФормы.Объект КАК Объект
       |ПОМЕСТИТЬ ВТЗаписываемыеОбъекты
       |ИЗ
       |	ВТДанныеФормы КАК ВТДанныеФормы
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК КлассификацияОбъектовДляМедРегистра
       |		ПО ВТДанныеФормы.Объект = КлассификацияОбъектовДляМедРегистра.Объект
       |			И ВТДанныеФормы.Классификатор = КлассификацияОбъектовДляМедРегистра.Классификатор
       |ГДЕ
       |	ВЫБОР
       |			КОГДА ВТДанныеФормы.Характеристика = ЕСТЬNULL(КлассификацияОбъектовДляМедРегистра.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка))
       |				ТОГДА ЛОЖЬ
       |			ИНАЧЕ ИСТИНА
       |		КОНЕЦ
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	ВТДанныеФормы.Объект КАК Объект,
       |	ВТДанныеФормы.Классификатор КАК Классификатор,
       |	ВТДанныеФормы.Характеристика КАК Характеристика
       |ИЗ
       |	ВТДанныеФормы КАК ВТДанныеФормы
       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаписываемыеОбъекты КАК ВТЗаписываемыеОбъекты
       |		ПО ВТДанныеФормы.Объект = ВТЗаписываемыеОбъекты.Объект
       |ГДЕ
       |	ВТЗаписываемыеОбъекты.Объект ЕСТЬ НЕ NULL 
       |
       |УПОРЯДОЧИТЬ ПО
       |	Объект,
       |	Классификатор";
				  
	ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗаписей.СледующийПоЗначениюПоля("Объект") Цикл
		
		НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ВыборкаЗаписей.Объект);
		
		Пока ВыборкаЗаписей.СледующийПоЗначениюПоля("Классификатор") Цикл
			
			НаборЗаписей.Отбор.Классификатор.Установить(ВыборкаЗаписей.Классификатор);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда 
				Если Не ЗначениеЗаполнено(ВыборкаЗаписей.Характеристика) Тогда
					НаборЗаписей.Очистить();
				Иначе
					НаборЗаписей[0].Характеристика = ВыборкаЗаписей.Характеристика;
				КонецЕсли;
			Иначе 
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ВыборкаЗаписей);
			КонецЕсли;
			
			НаборЗаписей.Записать();
						
		КонецЦикла;
		
	КонецЦикла;
	
	Модифицированность = Ложь;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонвертацияХарактеризуемыеОбъектыВТаблицу(ДеревоХарактеризуемыеОбъекты, Таблица, Характеристики)
	
	Для Каждого СтрокаДерева Из ДеревоХарактеризуемыеОбъекты.Строки Цикл
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			КонвертацияХарактеризуемыеОбъектыВТаблицу(СтрокаДерева, Таблица, Характеристики);
		Иначе
			
			Для Каждого Характеристика Из Характеристики Цикл
				
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Объект		   = СтрокаДерева.Объект;
				НоваяСтрока.Классификатор  = Характеристика.Классификатор;
				НоваяСтрока.Характеристика = СтрокаДерева[Характеристика.ИДСправочника];
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ТекущийОбъектМетаданныхПриИзмененииЗавершение(Ответ, Параметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		// Сохраним изменения
		ТекущийОбъектМетаданныхПриИзмененииНаСервере();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ТекущийОбъектМетаданныхПриИзмененииНаСервере();
	Иначе
		// Вернем предыдущий объект
		ТекущийОбъектМетаданных = ПредыдущийОбъектМетаданных;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТекущийОбъектМетаданныхПриИзмененииНаСервере()
	
	Если Модифицированность Тогда
		СохранениеИзмененийНаСервере();
	КонецЕсли;	
	
	ЗаполнитьТаблицуХарактеризуемыхОбъектов();	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииСопоставления

&НаКлиенте
Процедура СопоставитьЗавершение(Ответ, Параметры) Экспорт 
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		СохранятьИзменения = Не (Ответ = КодВозвратаДиалога.Нет);
		МодульИнтернетПоддержкаПользователейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент"); 
		АвтосопоставлениеПриНаличииПодключения = Новый ОписаниеОповещения("СопоставитьЗначенияИОбновитьТаблицу", ЭтотОбъект, СохранятьИзменения);
		МодульИнтернетПоддержкаПользователейКлиент.НачатьПроверкуИПодключениеИнтернетПоддержкиПользователей(АвтосопоставлениеПриНаличииПодключения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьЗначенияИОбновитьТаблицу(Знач АвтосопоставлениеВозможно, Знач СохранятьИзменения) Экспорт
	
	Если СохранятьИзменения Тогда
		СохранениеИзмененийНаСервере();
	КонецЕсли;	
	
	Если Не АвтосопоставлениеВозможно Тогда
		Возврат;
	КонецЕсли;	
	
	Токен = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		МодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей"); 
		ИПППодключена = МодульИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
		Если ИПППодключена Тогда 
			ВладелецТикета = МедицинскиеРегистры1СЕГИСЗ.ВладелецТикета1СЕГИСЗ();
			РезультатПолученияТикета = Медицина.ПолучитьТикетИПП(ВладелецТикета);
			Если РезультатПолученияТикета.Тикет <> Неопределено Тогда
				Токен = РезультатПолученияТикета.Тикет;
			Иначе
				ВызватьИсключение РезультатПолученияТикета.Ошибка;
			КонецЕсли;
		Иначе
			ВызватьИсключение НСтр("ru = 'Нет подключения к Интернет-поддержке пользователей.'");
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Токен) Тогда     
		
		ИспользоватьЕФС1 = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба");
		ОтборПоСинониму = Новый Структура("position", Неопределено);
		ОтборПоКодуОКПДТР = Новый Структура("CODE_OKPDTR", Неопределено);
		ОтборПоКодуЕФС1 = Новый Структура("CODE_EFC1", Неопределено);
		
		КлассификаторСсылка = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду("1.2.643.5.1.13.13.99.2.885");
		Если ЗначениеЗаполнено(КлассификаторСсылка) Тогда 
			
			ПакетЗапроса = НесопоставленныеДолжностиИЭлементыКлассификатора(КлассификаторСсылка);
	        Должности = ПакетЗапроса[0].Выгрузить();
	        ДолжностиКлассификатора = ПакетЗапроса[1].Выгрузить();
			
			Характеристики = Новый Соответствие;
			Для Каждого ДолжностьИзКлассификатора Из ДолжностиКлассификатора Цикл 
				Характеристики.Вставить(ДолжностьИзКлассификатора.Код, ДолжностьИзКлассификатора.Ссылка);
			КонецЦикла;  
			
			ШаблоныСопоставленийПоКодуЕФС1 = Неопределено;
			Если ИспользоватьЕФС1 Тогда
				ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей("885").ЕФС1;
				ШаблоныСопоставленийПоКодуЕФС1 = ПолучитьСопоставление(Токен, ИдентификаторСопоставления, "885");  
		    КонецЕсли;
			ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей("885").ОКПДТР;
			ШаблоныСопоставленийПоКодуОКПДТР = ПолучитьСопоставление(Токен, ИдентификаторСопоставления, "885");  
			ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей("885").Синонимы;
			ШаблоныСопоставленийПоСинониму = ПолучитьСопоставление(Токен, ИдентификаторСопоставления, "885");  
		
			Для Каждого Должность Из Должности Цикл
				
				ПредпочтительноеСопоставление = Неопределено;
				
				Если ИспользоватьЕФС1 И ШаблоныСопоставленийПоКодуЕФС1 <> Неопределено И Не ПустаяСтрока(Должность.КодЕФС1) Тогда	
					ОтборПоКодуЕФС1.CODE_EFC1 = Должность.КодЕФС1;   
					КоличествоИспользований = 0;  
					ВозможныеСопоставления = ШаблоныСопоставленийПоКодуЕФС1.НайтиСтроки(ОтборПоКодуЕФС1);
					Для Каждого Сопоставление Из ВозможныеСопоставления Цикл 
						Если Число(Сопоставление.count) > КоличествоИспользований Тогда 
							ПредпочтительноеСопоставление = Сопоставление;
						КонецЕсли;
					КонецЦикла;
					Если ПредпочтительноеСопоставление <> Неопределено Тогда 
	                    ЭлементКлассификатора = Характеристики.Получить(ПредпочтительноеСопоставление.ID_885);
						ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора);
						ЗаписатьСмежнуюХарактеристику(Должность, ЭлементКлассификатора);
					КонецЕсли;
				КонецЕсли;
				
				Если ПредпочтительноеСопоставление = Неопределено И ШаблоныСопоставленийПоКодуОКПДТР <> Неопределено Тогда 
					ОтборПоКодуОКПДТР.CODE_OKPDTR = Должность.КодОКПДТР;   
					КоличествоИспользований = 0;  
					ВозможныеСопоставления = ШаблоныСопоставленийПоКодуОКПДТР.НайтиСтроки(ОтборПоКодуОКПДТР);
					Для Каждого Сопоставление Из ВозможныеСопоставления Цикл 
						Если Число(Сопоставление.count) > КоличествоИспользований Тогда 
							ПредпочтительноеСопоставление = Сопоставление;
						КонецЕсли;
					КонецЦикла;
					Если ПредпочтительноеСопоставление <> Неопределено Тогда 
	                    ЭлементКлассификатора = Характеристики.Получить(ПредпочтительноеСопоставление.ID_885);
						ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора);
						ЗаписатьСмежнуюХарактеристику(Должность, ЭлементКлассификатора);
					КонецЕсли;
				КонецЕсли;
				
				Если ПредпочтительноеСопоставление = Неопределено И ШаблоныСопоставленийПоСинониму <> Неопределено Тогда 
					ОтборПоСинониму.position = ВРег(Должность.Наименование);   
					КоличествоИспользований = 0;  
					ВозможныеСопоставления = ШаблоныСопоставленийПоСинониму.НайтиСтроки(ОтборПоСинониму);
					Для Каждого Сопоставление Из ВозможныеСопоставления Цикл 
						Если Число(Сопоставление.count) > КоличествоИспользований Тогда 
							ПредпочтительноеСопоставление = Сопоставление;
						КонецЕсли;
					КонецЦикла;
					Если ПредпочтительноеСопоставление <> Неопределено Тогда 
	                    ЭлементКлассификатора = Характеристики.Получить(ПредпочтительноеСопоставление.ID_885);
						ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора);
						ЗаписатьСмежнуюХарактеристику(Должность, ЭлементКлассификатора);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;	
			
		КлассификаторСсылка = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду("1.2.643.5.1.13.13.99.2.181");
		Если ЗначениеЗаполнено(КлассификаторСсылка) Тогда 
			
			ПакетЗапроса = НесопоставленныеДолжностиИЭлементыКлассификатора(КлассификаторСсылка);
	        Должности = ПакетЗапроса[0].Выгрузить();
	        ДолжностиКлассификатора = ПакетЗапроса[1].Выгрузить();
			
			Характеристики = Новый Соответствие;
			Для Каждого ДолжностьИзКлассификатора Из ДолжностиКлассификатора Цикл 
				Характеристики.Вставить(ДолжностьИзКлассификатора.Код, ДолжностьИзКлассификатора.Ссылка);
			КонецЦикла;  
			
			ШаблоныСопоставленийПоКодуЕФС1 = Неопределено;
			Если ИспользоватьЕФС1 Тогда
				ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей("181").ЕФС1;
				ШаблоныСопоставленийПоКодуЕФС1 = ПолучитьСопоставление(Токен, ИдентификаторСопоставления, "181");  
		    КонецЕсли;
			ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей("181").ОКПДТР;
			ШаблоныСопоставленийПоКодуОКПДТР = ПолучитьСопоставление(Токен, ИдентификаторСопоставления, "181");  
			ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей("181").Синонимы;
			ШаблоныСопоставленийПоСинониму = ПолучитьСопоставление(Токен, ИдентификаторСопоставления, "181");  
			
			Для Каждого Должность Из Должности Цикл 

				ПредпочтительноеСопоставление = Неопределено; 
				
				Если ИспользоватьЕФС1 И ШаблоныСопоставленийПоКодуЕФС1 <> Неопределено И Не ПустаяСтрока(Должность.КодЕФС1) Тогда	
					ОтборПоКодуЕФС1.CODE_EFC1 = Должность.КодЕФС1;   
					КоличествоИспользований = 0;  
					ВозможныеСопоставления = ШаблоныСопоставленийПоКодуЕФС1.НайтиСтроки(ОтборПоКодуЕФС1);
					Для Каждого Сопоставление Из ВозможныеСопоставления Цикл 
						Если Число(Сопоставление.count) > КоличествоИспользований Тогда 
							ПредпочтительноеСопоставление = Сопоставление;
						КонецЕсли;
					КонецЦикла;
					Если ПредпочтительноеСопоставление <> Неопределено Тогда 
	                    ЭлементКлассификатора = Характеристики.Получить(ПредпочтительноеСопоставление.ID_181);
						ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора);
					КонецЕсли;
				КонецЕсли;
				
				Если ПредпочтительноеСопоставление = Неопределено И ШаблоныСопоставленийПоКодуОКПДТР <> Неопределено Тогда 
					ОтборПоКодуОКПДТР.CODE_OKPDTR = Должность.КодОКПДТР;   
					КоличествоИспользований = 0;  
					ВозможныеСопоставления = ШаблоныСопоставленийПоКодуОКПДТР.НайтиСтроки(ОтборПоКодуОКПДТР);
					Для Каждого Сопоставление Из ВозможныеСопоставления Цикл 
						Если Число(Сопоставление.count) > КоличествоИспользований Тогда 
							ПредпочтительноеСопоставление = Сопоставление;
						КонецЕсли;
					КонецЦикла;
					Если ПредпочтительноеСопоставление <> Неопределено Тогда 
	                    ЭлементКлассификатора = Характеристики.Получить(ПредпочтительноеСопоставление.ID_181);
						ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора);
					КонецЕсли;
				КонецЕсли;
				
				Если ПредпочтительноеСопоставление = Неопределено И ШаблоныСопоставленийПоСинониму <> Неопределено Тогда 
					ОтборПоСинониму.position = ВРег(Должность.Наименование);   
					КоличествоИспользований = 0;  
					ВозможныеСопоставления = ШаблоныСопоставленийПоСинониму.НайтиСтроки(ОтборПоСинониму);
					Для Каждого Сопоставление Из ВозможныеСопоставления Цикл 
						Если Число(Сопоставление.count) > КоличествоИспользований Тогда 
							ПредпочтительноеСопоставление = Сопоставление;
						КонецЕсли;
					КонецЦикла;
					Если ПредпочтительноеСопоставление <> Неопределено Тогда 
	                    ЭлементКлассификатора = Характеристики.Получить(ПредпочтительноеСопоставление.ID_181);
						ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора);
					КонецЕсли;
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
		ЗаполнитьТаблицуХарактеризуемыхОбъектов();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция НесопоставленныеДолжностиИЭлементыКлассификатора(КлассификаторСсылка)
	
	Запрос = Новый Запрос;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.Ссылка КАК Ссылка,
		|	Должности.Наименование КАК Наименование,
		|	Должности.НаименованиеКраткое КАК НаименованиеКраткое,
		|	Должности.ОКПДТРКод КАК КодОКПДТР,
		|	СвойстваДолжностейГосударственнойСлужбы.КодНаименованияДолжности КАК КодЕФС1
		|ИЗ
		|	Справочник.Должности КАК Должности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектовДляФедеральныхМедрегистров
		|		ПО (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект = Должности.Ссылка)
		|			И (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Классификатор = &Классификатор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейГосударственнойСлужбы КАК СвойстваДолжностейГосударственнойСлужбы
		|		ПО (Должности.Ссылка = СвойстваДолжностейГосударственнойСлужбы.Должность)
		|ГДЕ
		|	(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика ЕСТЬ NULL
		|			ИЛИ ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика = ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭлементыКлассификаторовФедеральныхМедрегистров.Код КАК Код,
		|	ЭлементыКлассификаторовФедеральныхМедрегистров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторовФедеральныхМедрегистров
		|ГДЕ
		|	ЭлементыКлассификаторовФедеральныхМедрегистров.Владелец = &Классификатор";
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.Ссылка КАК Ссылка,
		|	Должности.Наименование КАК Наименование,
		|	Должности.НаименованиеКраткое КАК НаименованиеКраткое,
		|	Должности.ОКПДТРКод КАК КодОКПДТР,
		|	"""" КАК КодЕФС1
		|ИЗ
		|	Справочник.Должности КАК Должности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектовДляФедеральныхМедрегистров
		|		ПО (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект = Должности.Ссылка)
		|			И (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Классификатор = &Классификатор)
		|ГДЕ
		|	(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика ЕСТЬ NULL
		|			ИЛИ ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика = ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭлементыКлассификаторовФедеральныхМедрегистров.Код КАК Код,
		|	ЭлементыКлассификаторовФедеральныхМедрегистров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторовФедеральныхМедрегистров
		|ГДЕ
		|	ЭлементыКлассификаторовФедеральныхМедрегистров.Владелец = &Классификатор";
	КонецЕсли;
	Запрос.УстановитьПараметр("Классификатор", КлассификаторСсылка);
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	Возврат ПакетЗапроса;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСопоставленнуюХарактеристику(Должность, КлассификаторСсылка, ЭлементКлассификатора)
	
	Если ЗначениеЗаполнено(ЭлементКлассификатора) Тогда 
		НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Должность.Ссылка);
		НаборЗаписей.Отбор.Классификатор.Установить(КлассификаторСсылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда 
			НаборЗаписей[0].Характеристика = ЭлементКлассификатора;
			НаборЗаписей[0].ИсточникЗаполнения = 1;
		Иначе
			НовоеСопоставление = НаборЗаписей.Добавить(); 
			НовоеСопоставление.Объект = Должность.Ссылка;
			НовоеСопоставление.Классификатор = КлассификаторСсылка;
			НовоеСопоставление.Характеристика = ЭлементКлассификатора;
			НовоеСопоставление.ИсточникЗаполнения = 1;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьСмежнуюХарактеристику(Должность, ЭлементКлассификатора885)
	
	Классификатор181 = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду("1.2.643.5.1.13.13.99.2.181");
	Если ЗначениеЗаполнено(ЭлементКлассификатора885) И ЗначениеЗаполнено(Классификатор181) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭлементыКлассификаторовФедеральныхМедрегистров.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ОписаниеЭлемента КАК ЭлементыКлассификаторовФедеральныхМедрегистровОписаниеЭлемента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторовФедеральныхМедрегистров
			|		ПО (ЭлементыКлассификаторовФедеральныхМедрегистровОписаниеЭлемента.Ссылка = &Ссылка)
			|			И (ЭлементыКлассификаторовФедеральныхМедрегистров.Владелец = &Классификатор)
			|			И (ЭлементыКлассификаторовФедеральныхМедрегистровОписаниеЭлемента.Поле = ""id_181""
			|				ИЛИ ЭлементыКлассификаторовФедеральныхМедрегистровОписаниеЭлемента.Поле = ""ID_181"")
			|			И ЭлементыКлассификаторовФедеральныхМедрегистровОписаниеЭлемента.Значение = ЭлементыКлассификаторовФедеральныхМедрегистров.Код";
		
		Запрос.УстановитьПараметр("Классификатор", Классификатор181);
		Запрос.УстановитьПараметр("Ссылка", ЭлементКлассификатора885);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда 
			НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Должность.Ссылка);
			НаборЗаписей.Отбор.Классификатор.Установить(Классификатор181);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда 
				НаборЗаписей[0].Характеристика = Выборка.Ссылка;
				НаборЗаписей[0].ИсточникЗаполнения = 1;
			Иначе
				НовоеСопоставление = НаборЗаписей.Добавить(); 
				НовоеСопоставление.Объект = Должность.Ссылка;
				НовоеСопоставление.Классификатор = Классификатор181;
				НовоеСопоставление.Характеристика = Выборка.Ссылка;
				НовоеСопоставление.ИсточникЗаполнения = 1;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСопоставление(Токен, ИдентификаторСопоставления, НомерКлассификатора)
	
	HTTPСоединение = МедицинскиеРегистры1СЕГИСЗ.СоздатьСоединение();
	РазмерПорции = 200;  
	
	СодержимоеКлассификатора = ПустаяТаблицаШаблонаСопоставлений(ИдентификаторСопоставления, НомерКлассификатора);
	
	Пока Истина Цикл 
	
		СтруктураОтвета = МедицинскиеРегистры1СЕГИСЗ.ВыполнитьЗапросОчереднойПорции(HTTPСоединение, ИдентификаторСопоставления, РазмерПорции, Токен);
		Если СтруктураОтвета.СообщениеОбОшибке <> Неопределено Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка сопоставления классификатора должностей с 1С:ЕГИСЗ'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				УровеньЖурналаРегистрации.Предупреждение, , , СтруктураОтвета.СообщениеОбОшибке);
			Возврат Неопределено;
		КонецЕсли;
		
	    ОтветСервера = СтруктураОтвета.ОтветСервера;
		Если ОтветСервера = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ОтветСервера.Получить("hasNext") = Неопределено Или ОтветСервера.Получить("list") = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
						
		Для Каждого СтрокаЭлемента Из ОтветСервера.Получить("list") Цикл
			СтруктураЭлемента = Новый Структура();
			Для Каждого ОписаниеРеквизита Из СтрокаЭлемента Цикл
				СтруктураЭлемента.Вставить(ОписаниеРеквизита.Получить("column"), ОписаниеРеквизита.Получить("value"));
			КонецЦикла;
			ЭлементКлассификатора = СодержимоеКлассификатора.Добавить();  
			ЗаполнитьЗначенияСвойств(ЭлементКлассификатора, СтруктураЭлемента);
			Если ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей(НомерКлассификатора).Синонимы Тогда
				ЭлементКлассификатора.position = ВРег(ЭлементКлассификатора.position);
			КонецЕсли;
		КонецЦикла;
		
		Если Не ОтветСервера.Получить("hasNext") Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СодержимоеКлассификатора;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПустаяТаблицаШаблонаСопоставлений(ИдентификаторСопоставления, НомерКлассификатора)
	
	Если ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей(НомерКлассификатора).ЕФС1 Тогда   
		
		ТаблицаСправочникаФРМР = Новый ТаблицаЗначений();
		ТаблицаСправочникаФРМР.Колонки.Добавить("ROWID",             ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("ID_" + НомерКлассификатора, ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаСправочникаФРМР.Колонки.Добавить("codeSystemVersion", ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("CODE_EFC1",         ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("count",             ОбщегоНазначения.ОписаниеТипаСтрока(10));     
		
		ТаблицаСправочникаФРМР.Индексы.Добавить("CODE_EFC1");
		
	ИначеЕсли ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей(НомерКлассификатора).ОКПДТР Тогда   
		
		ТаблицаСправочникаФРМР = Новый ТаблицаЗначений();
		ТаблицаСправочникаФРМР.Колонки.Добавить("ROWID",             ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("ID_" + НомерКлассификатора, ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаСправочникаФРМР.Колонки.Добавить("codeSystemVersion", ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("CODE_OKPDTR",       ОбщегоНазначения.ОписаниеТипаСтрока(5));
		ТаблицаСправочникаФРМР.Колонки.Добавить("count",             ОбщегоНазначения.ОписаниеТипаСтрока(10));
		
		ТаблицаСправочникаФРМР.Индексы.Добавить("CODE_OKPDTR");   
		
	ИначеЕсли ИдентификаторСопоставления = МедицинскиеРегистры1СЕГИСЗ.ИдентификаторыСопоставленийДолжностей(НомерКлассификатора).Синонимы Тогда   
		
		ТаблицаСправочникаФРМР = Новый ТаблицаЗначений();
		ТаблицаСправочникаФРМР.Колонки.Добавить("ROWID",             ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("ID_" + НомерКлассификатора, ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаСправочникаФРМР.Колонки.Добавить("codeSystemVersion", ОбщегоНазначения.ОписаниеТипаСтрока(10));
		ТаблицаСправочникаФРМР.Колонки.Добавить("position",          ОбщегоНазначения.ОписаниеТипаСтрока(500));
		ТаблицаСправочникаФРМР.Колонки.Добавить("count",             ОбщегоНазначения.ОписаниеТипаСтрока(10));    
		
		ТаблицаСправочникаФРМР.Индексы.Добавить("position");   
		
	Иначе 
		
		ТаблицаСправочникаФРМР = Неопределено;  
		
	КонецЕсли;
	
	Возврат ТаблицаСправочникаФРМР;
	
КонецФункции

#КонецОбласти

#КонецОбласти
